

class GameCirulli():
    def __init__(self, size: int):
        """
        На вход, при создании объекта передаётся размер квадрата
        Также тут объявляются все переменные которые будут использоваться
         в последующих методах.
        """
        ...

    def __del__(self):
        ...

    def generate_points(self, ):
        """
        Генерация рандомный точек в матрице
        """

        ...

    # Наверное, можно сделать движения одним методом,
    #  в который в качестве аргумента будет приходить одно из значений перечисления
    def move_right(self, ):
        """
        Движеное вправо
        """

        ...

    def move_left(self, ):
        """
        Движение влево
        """

        ...

    def move_up(self, ):
        """
        Движеное вверх
        """

        ...

    def move_down(self, ):
        """
        Движение вниз
        """

        ...

    def drow_matrix(self, ):
        """
        Рисует картинку по двумерному массиву в данных
        """

        ...
    ...
